#include <bits/stdc++.h>
using namespace std;
int main()
{
    char a, b, c, d, e, f, g, h, i, j, k, l, m, n, o, p;
    cout << "1：如果你遇到了喜欢的人，会选择告白吗？" << endl;
    cout << "   A：告白（进入第二题）；B：不告白（进入第三题）" << endl;
    cin >> a;
    if (a == 65)
    {
        cout << "2：如果你对喜欢的人告白后，她拒绝了你，你会怎么做？" << endl;
        cout << "A：继续喜欢（进入第三题）；B：放弃喜欢（进B入最后一题）" << endl;
        cin >> b;
        if (b == 65)
        {
            cout << "3：如果你喜欢的女孩遇到了危险，你若是救她，同样也会遇到危险，你还愿意救她吗？" << endl;
            cout << "  A：我愿意（进入第四题）；B：不确定或者不愿意（进入最后一题）" << endl;
            cin >> c;
            if (c == 65)
            {
                cout << "4：如果让你一贫如洗，你才能得到你喜欢的人，你会拿你全部的财产来换她一生吗？" << endl;
                cout << "A：会（进入第五题）；B：不会（进入最后一题）" << endl;
                cin >> d;
                if (d == 65)
                {
                    cout << "5：如果你只有失去你喜欢的人，才能实现你一直以来的梦想，你会选择梦想还是你喜欢的人？" << endl;
                    cout << " A：喜欢的人（进入第六题）；B：梦想（进入最后一题）" << endl;
                    cin >> f;
                    if (f == 65)
                    {
                        cout << "   6：如果有个叫的男孩对你表白，你会接受吗？" << endl;
                        cout << "  A：接受；B：我喜欢你" << endl;
                        cin >> g;
                        cout << "我不知道你的答案是什么，但是我的答案是：A、A、A、A、A、B。" << endl;
                        cout << " 这个答案的意思是：我喜欢你，如果你不喜欢我，没关系，我依旧会喜欢你，喜欢你到愿意为你放弃生命，放弃金钱，甚至放弃梦想。" << endl;
                        cout << "如果你不接受我的喜欢，没关系，我希望你这一生都能好好的喜欢你自己，一定请你善待自己，照顾好自己，千万不要辜负自己。" << endl;
                    }
                }
                else
                {
                    cout << "   6：如果有个叫的男孩对你表白，你会接受吗？" << endl;
                    cout << "  A：接受；B：我喜欢你" << endl;
                    cin >> p;
                    cout << "我不知道你的答案是什么，但是我的答案是：A、A、A、A、A、B。" << endl;
                    cout << " 这个答案的意思是：我喜欢你，如果你不喜欢我，没关系，我依旧会喜欢你，喜欢你到愿意为你放弃生命，放弃金钱，甚至放弃梦想。" << endl;
                    cout << "如果你不接受我的喜欢，没关系，我希望你这一生都能好好的喜欢你自己，一定请你善待自己，照顾好自己，千万不要辜负自己。" << endl;
                }
            }
        }
    }
    else
    {
        cout << "3：如果你喜欢的女孩遇到了危险，你若是救她，同样也会遇到危险，你还愿意救她吗？" << endl;
        cout << "  A：我愿意（进入第四题）；B：不确定或者不愿意（进入最后一题）" << endl;
        cin >> h;
        if (h == 65)
        {
            cout << "4：如果让你一贫如洗，你才能得到你喜欢的人，你会拿你全部的财产来换她一生吗？" << endl;
            cout << "A：会（进入第五题）；B：不会（进入最后一题）" << endl;
            cin >> i;
            if (i == 65)
            {
                cout << "5：如果你只有失去你喜欢的人，才能实现你一直以来的梦想，你会选择梦想还是你喜欢的人？" << endl;
                cout << " A：喜欢的人（进入第六题）；B：梦想（进入最后一题）" << endl;
                cin >> j;
                if (j == 65)
                {
                    cout << "   6：如果有个叫的男孩对你表白，你会接受吗？" << endl;
                    cout << "  A：接受；B：我喜欢你" << endl;
                    cin >> k;
                    cout << "我不知道你的答案是什么，但是我的答案是：A、A、A、A、A、B。" << endl;
                    cout << " 这个答案的意思是：我喜欢你，如果你不喜欢我，没关系，我依旧会喜欢你，喜欢你到愿意为你放弃生命，放弃金钱，甚至放弃梦想。" << endl;
                    cout << "如果你不接受我的喜欢，没关系，我希望你这一生都能好好的喜欢你自己，一定请你善待自己，照顾好自己，千万不要辜负自己。" << endl;
                }
                else
                {
                    cout << "   6：如果有个叫的男孩对你表白，你会接受吗？" << endl;
                    cout << "  A：接受；B：我喜欢你" << endl;
                    cin >> m;
                    cout << "我不知道你的答案是什么，但是我的答案是：A、A、A、A、A、B。" << endl;
                    cout << " 这个答案的意思是：我喜欢你，如果你不喜欢我，没关系，我依旧会喜欢你，喜欢你到愿意为你放弃生命，放弃金钱，甚至放弃梦想。" << endl;
                    cout << "如果你不接受我的喜欢，没关系，我希望你这一生都能好好的喜欢你自己，一定请你善待自己，照顾好自己，千万不要辜负自己。" << endl;
                }
            }
        }
        else
        {
            cout << "   6：如果有个叫的男孩对你表白，你会接受吗？" << endl;
            cout << "  A：接受；B：我喜欢你" << endl;
            cin >> l;
            cout << "我不知道你的答案是什么，但是我的答案是：A、A、A、A、A、B。" << endl;
            cout << " 这个答案的意思是：我喜欢你，如果你不喜欢我，没关系，我依旧会喜欢你，喜欢你到愿意为你放弃生命，放弃金钱，甚至放弃梦想。" << endl;
            cout << "如果你不接受我的喜欢，没关系，我希望你这一生都能好好的喜欢你自己，一定请你善待自己，照顾好自己，千万不要辜负自己。" << endl;
        }
    }
    return 0;
}
